haivivi/embed-zig/examples/esp/wifi_dns_lookup/c/sdkconfig.defaults
# ESP32-S3-DevKitC-1 with PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CPU Frequency 240MHz
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# Run code from PSRAM (reduces IRAM usage)
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# WiFi
CONFIG_WIFI_SSID="HAIVIVI-MFG"
CONFIG_WIFI_PASSWORD="!haivivi"

# HTTP Client for DoH
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# mbedTLS CA bundle for HTTPS (DoH)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS configuration
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Disable unused
CONFIG_BT_ENABLED=n

# Increase task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Use PSRAM for WiFi/LWIP buffers
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
